<template>
  <view class="wrapper">
    <myCustomNavbar :navStyle="{background:'#ffffff',color:'#000000'}" title="Whack“福袋”互动功能服务协议" @backPage="backPage"></myCustomNavbar>
    <view class="mt32">协议生效日期：2026年1月8日</view>
    <view>一、本协议是由上海格乐喜网络信息科技有限公司与使用“福袋”功能的用户之间，就使用“福袋”互动功能所订立的协议。您勾选本协议或开始使用“福袋”互动功能时，本协议立即成立并生效。请您在开始使用“福袋”互动功能之前，认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款等。平台有权根据需要不定时地制定、修改本协议及平台规则，修订后的协议、平台规则公布后生效，对使用“福袋”互动功能的用户发生法律效力。</view>
    <view>二、“福袋”功能为社群内的用户（以下统称“用户”）的互动功能。用户参与“福袋”的玩法（以下称“本服务”），应遵守与平台签署的《Whack“福袋”互动功能服务协议》、本规则及与本服务相关的其他规则（以下统称“平台规则”）。</view>
    <view>三、用户理解并同意：本服务中平台仅提供相关技术服务，实际利用本服务而向其他用户提供的全部内容由发起“福袋”玩法的用户独立负责，平台并不具体参与上述内容的任何环节。因此使用服务的用户及参与用户使用本服务发生任何争议的，应由发起用户与参与用户自行协商解决，平台对此不承担任何法律后果。</view>
    <view>四、用户理解并同意：群内用户发起“福袋”活动后，因不可抗力（不可抗力是指不能预见、不能克服并不能避免的客观事件，包括但不限于自然灾害、疫情影响、政府行为、系统故障、意外事件、社会异常事件、罢工、恐怖事件、骚乱、战争、网络原因、黑客攻击等）造成的活动中途停止的，平台无须就活动中途终止承担责任。</view>
    <view>五、用户使用本服务的行为应符合相关法律法规规定及平台规则，<span class="font-bold">用户在社群内发放福袋和参与领取福袋的行为，视为用户个人行为，用户需要承担所有责任，平台不承担任何责任。</span>且不得存在任何违反上述规定/规则、侵犯任何第三人合法权益的情况。同时，用户不得以任何违法或违反公序良俗的方式使用本服务（包括但不限于利用本服务开展涉嫌赌博、诈骗性质的活动等），否则应当自行承担可能因此产生的责任和损失，如因此给平台造成任何损失的，用户还应当赔偿。用户违反本条的，平台有权保存用户相关违法违规或不当行为的记录，并将其移送给相关行政或司法机关予以处理。</view>
    <view class="font-bold">六、本服务收取每个福袋10%的服务费，所在的社群收益8%，平台收入2%。用户在使用福袋功能时，完成嗨币支付福袋在社群中发出，即视为本次服务消费已完成，不得删除、撤销、更改已经发起的“福袋”，用户不能要求平台进行退款。</view>
    <view>七、为保障本服务有序、健康运行，平台可能会根据本服务的具体运营情况，设定用户单位时间内可领取和发出的福袋上限（对应价值上限或数量上限等）。如因上述限制而导致用户发起的福袋尚有参与用户名额或奖励剩余的，剩余部分将返还用户，福袋中的VIP体验天数道具如未被领取，将退回到用户福利袋内。平台无须就此对被限制的该用户承担任何责任。</view>
    <view>八、用户使用本服务向其他用户提供的福袋奖励内容应当符合法律法规及平台规则的要求，对奖励内容的描述应当真实、客观、准确，不得存在误导，<span class="font-bold">单个用户单天累计最高福袋发放的奖励不能高于10,000嗨币，单个用户单天累计领取的福袋奖励不能高于10,000福气值。用户不得以不可达成、无效条件作为奖励前提，或事后以各种理由拒绝履行奖励义务，不得删除、撤销、更改已经发起的“福袋”活动，不得存在其他违法违规或违反平台规则的情形。 同一个账号、同一个手机号、同一个设备或同一个提现账户，均视为同一个用户，同一个用户仅能在每个月对福袋提现500福气值。</span></view>
    <view>九、用户参与社群内其他用户发起的“福袋”玩法应符合社群内设置的参与条件，并确保在“福袋”公布结果后可以在福袋领取结果页面查看。用户应当使用合法注册的平台账号使用本服务，同时用户不得以任何不正当手段（例如恶意注册多个账号参与互动）及舞弊、使用外挂插件等行为参与“福袋”活动。否则，平台有权立即暂停或停止向用户提供本服务，且平台有权收回用户使用本服务所获得的所有权益或收益（尚未发放的不予发放）作为违约赔偿、封禁账号等。如用户违反本条规定给平台造成其他损失的，用户还应当全额赔偿。如因参与“福袋”的用户存在上述行为发放福袋的用户提出任何权利主张的，应由该相关用户与用户之间自行解决并承担相应责任，平台对此不承担任何法律责任。</view>
    <view>十、平台可能根据法律法规或监管要求、业务规划变更等因素停止提供本服务或变更本服务相关规则。变更后的本服务相关规则将在平台予以公告或以其他适当形式通知用户。如用户不同意相关变更，应停止使用本服务；如用户继续使用本服务的，视为同意变更后的规则。</view>
    <view>十一、因本规则发生的或与本规则相关的纠纷，各方均应友好协商解决，未能解决的，应提交本规则签署地即上海市临港自贸区有管辖权的人民法院诉讼解决。</view>
    <view>十二、用户对本服务有任何疑问或投诉、举报等反馈，均可通过【设置】-【官方客服】与平台联系。</view>
    
    <view class="text-right">上海格乐喜网络信息科技有限公司</view>
  </view>
</template>

<script setup>
  import myCustomNavbar from '@/components/myCustomNavbar.vue'
  
  
  function backPage() {
    window.client.closeWebview()
  }
</script>
<style lang="scss" scoped>
  .wrapper {
    padding: 88rpx 32rpx;
    background-color: #ffffff;
    view {
      margin-bottom: 20rpx;
      font-weight: 400;
      font-size: 32rpx;
      color: rgba(0,0,0,0.8);
      line-height: 48rpx;
    }
    .mt32 {
      margin-top: 60rpx;
    }
    .text-right {
      text-align: right;
    }
    .font-bold {
      font-weight: bold;
    }
  }
</style>