<template>
  <view class="wrapper">
    <view class="title">咓咔社群隐私政策</view>
    <view class="text-right mt32">2024年11月21日生效</view>
    <view class="text-indent">欢迎您使用咓咔社群平台服务！我们珍视您在向我们提供您的个人信息时对我们 的信任，我们将按照本隐私政策处理您的个人信息并保障您信息的安全。</view>
    <view>引言</view>
    
    <view class="text-indent">咓咔社群平台（以下简称“平台”）是上海格乐喜网络信息科技有限公司（以下称“我们”）<span class="font-bold">开发的一款垂直的社群类型的即时通讯产品，这里拥有各式各样的社群和爱好者，具备社群互动所必备的功能，包括社群经营（创建社群空间和多主题聊天）、结交朋友（回复、发私信）。</span>为向您提供上述服务，我们会收集您必要的个人信息，此隐私政策旨在帮助您了解我们收集您个人信息的类型及 我们如何利用和保护您的个人信息，同时我们也向您介绍了我们的隐私控制功能，您可以利用这些功能自主控制您个人信息的使用方式。</view>
    <view class="text-indent"><span class="font-bold">本隐私政策适用于您通过</span>咓咔社群<span class="font-bold">平台的移动端、供第三方网站和应用程序使用的平台软件开发工具包（SDK）等方式来访问和使用我们的产品和服务。</span></view>
    <view>请您务必认真阅读本隐私政策，在确认充分了解并同意后再使用咓咔社群平台服务。</view>
    <view>本隐私政策将帮助您了解以下内容：</view>
    <view>1.我们如何收集和使用您的个人信息</view>
    <view>2.我们如何使用Cookie和同类技术</view>
    <view>3.我们如何共享、转让、公开披露您的个人信息</view>
    <view>4.我们如何保存及保护您的个人信息</view>
    <view>5.您的权利</view>
    <view>6.我们如何处理未成年人的个人信息</view>
    <view>7.您的个人信息如何进行跨境转移</view>
    <view>8.隐私政策的修订</view>
    <view>9.如何联系我们</view>
    <view>一、我们如何收集和使用您的个人信息</view>
    <view class="font-bold">个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别您的身份或者反映您的活动情况的各种信息。我们根据合法、正当、必要的原则，仅收集实现产品功能所必要的信息。</view>
    <view>(一) 您直接提供和我们自动采集的个人信息</view>
    <view>1. 咓咔社群平台业务功能</view>
    <view>平台业务功能主要是实现社群互动所必备的功能，包括社群经营（创建社群空间和多主题聊天）、结交朋友（回复、发私信）。</view>
    <view>2. 平台各项功能需要收集和使用的个人信息</view>
    <view>(1) 平台注册、登录、认证涉及的个人信息</view>
    <view>1）平台账号注册信息</view>
    <view class="font-bold">若您使用平台发布信息或进行社交，则您需要注册并登录平台账号。注册平台通用帐号时，您至少需向我们提供手机号；您还可以提供头像、帐号名称，以丰富您的帐号信息。</view>
    <view>(2)使用平台各项业务功能涉及的个人信息和权限</view>
    <view>1）设备和日志信息</view>
    <view class="font-bold">与大多数互联网服务一样，我们的服务器会自动记录您在访问平台时所发出的请求，例如您输入的搜索关键词信息，您浏览和发布的贴文及评论信息，您上传的图片和视频信息、您的交易信息、您的IP地址、浏览器的类型和使用的语言、 硬件设备信息、操作系统的版本、网络运营商的信息、您访问服务的日期、时间、时长等。</view>
    <view><span class="font-bold">当您使用“平台”移动应用时，为了保障您正常使用“平台”移动应用服务，更 准确定位并解决您在使用“平台”移动应用服务时遇到的问题，改进及优化“平 台”移动应用的服务体验，保障您的账号安全，我们会收集设备属性信息（例如 您的硬件型号、操作系统版本、设备配置、唯一设备标识符、国际移动设备身份 码IMEI、网络设备硬件地址MAC、广告标识符IDFA、匿名设备标识符(OAID)）， 剪切板信息（便于用户复制、分享信息），设备连接信息（浏览器的类型、电 信运营商、使用的语言，用于判断网络情况）以及设备状态信息（例如设备传感 器数据：用于适配您的设备状态或在您选择参与活动时以识别您的动作；对于从您的各种设备上收集到的信息，我们可能会将它们 进行关联，以便我们能在这些设备上为您提供一致的服务。我们可能会将您的设备信息或电话号码与您的平台帐户相关联。</span>同时，请您理解，当您将处于设备屏 幕中“平台”移动应用切换到设备后台运行时，由于部分设备机型及系统原因，您此前使用“平台”移动应用相关功能而产生的信息收集行为，可能无法立即停止，从而导致短暂的后台信息收集行为。</view>
    <view>2）位置信息</view>
    <view>当您在发布的内容中展示您的位置时，<span class="font-bold">经过您的授权后我们会读取并展示您的地 理位置信息，</span>位置信息属于您的敏感个人信息，您可以随时在系统中取消定位授权。</view>
    <view>3）各项业务功能对系统隐私权限的调用</view>
    
    
    <view class="tableList">
      <uni-table ref="tableList" emptyText="暂无数据">
        <uni-tr>
          <uni-th :width="tableWidth">设备权限</uni-th>
          <uni-th :width="tableWidth">业务功能</uni-th>
          <uni-th :width="tableWidth">权限授权方式</uni-th>
          <uni-th :width="tableWidth">可否关闭</uni-th>
        </uni-tr>
        <uni-tr>
          <uni-td :width="tableWidth">网络</uni-td>
          <uni-td :width="tableWidth">上网功能</uni-td>
          <uni-td :width="tableWidth"></uni-td>
          <uni-td :width="tableWidth">是</uni-td>
        </uni-tr>
        <uni-tr>
          <uni-td :width="tableWidth">相机（摄像头）</uni-td>
          <uni-td :width="tableWidth">消息</uni-td>
          <uni-td :width="tableWidth"></uni-td>
          <uni-td :width="tableWidth">是</uni-td>
        </uni-tr>
        <uni-tr>
          <uni-td :width="tableWidth">存储（相册，媒体和其他文件）</uni-td>
          <uni-td :width="tableWidth">
            <view class="size">1.编辑个人资料</view>
            <view class="size">2.创建社区</view>
            <view class="size">3.编辑社区资料</view>
            <view class="size">4.消息 </view>
            <view class="size">5.APP安全运行与风控验证</view>
          </uni-td>
          <uni-td :width="tableWidth"></uni-td>
          <uni-td :width="tableWidth">是</uni-td>
        </uni-tr>
        <uni-tr>
          <uni-td :width="tableWidth">通知</uni-td>
          <uni-td :width="tableWidth">系统通知</uni-td>
          <uni-td :width="tableWidth"></uni-td>
          <uni-td :width="tableWidth">是</uni-td>
        </uni-tr>
      </uni-table>
    </view>
    <view>(二) 为您提供安全保障</view>
    <view class="font-bold">为提高您使用我们与关联公司、合作方提供的产品和服务的安全性，我们可能使用您的信息用于身份验证、客户服务、安全防范、诈骗监测、信贷分析等，以预防、发现、调查欺诈、危害安全、非法或违反与我们的协议、政策或规则的行为，以保护您、我们的其他用户、我们或关联公司、合作方及社会公众的合法权益。</view>
    <view>提示您注意，当我们要将信息用于本隐私政策未载明的其它用途时，会事先征 求您的同意</view>。
    <view>(三) 事先征得授权同意的例外</view>
    <view>请注意，在以下情形中，收集、使用个人信息无需事先征得您的授权同意：</view>
    <view>1. 与国家安全、国防安全直接相关的；</view>
    <view>2. 与公共安全、公共卫生、重大公共利益直接相关的；</view>
    <view>3. 与犯罪侦查、起诉、审判和判决执行等直接有关的；</view>
    <view>4. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
    <view>5. 所收集的个人信息是您自行向社会公众公开的；</view>
    <view>6. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</view>
    <view>7. 根据您的要求签订和履行合同所必需的；</view>
    <view>8. 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</view>
    <view>9. 为开展合法的新闻报道所必需的；</view>
    <view>10. 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</view>
    <view>11. 法律法规规定的其他情形。</view>
    <view>二、我们如何使用 Cookie 和同类技术</view>
    <view>为确保网站正常运转，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。<span class="font-bold">Cookie通常包含标识符、站点名称以及一些号码和字符。Cookie 主要的功能是便于您使用网站产品和服务，以及帮助网站统计独立访客数量等。</span></view>
    <view class="font-bold">当您使用平台产品和服务时，会向您的设备发送Cookie。当您与我们提供给合 作伙伴的服务（例如广告和/或推广服务，以及可能显示在其他网站上的由平台 提供的服务功能）进行交互时，我们允许Cookie（或者其他匿名标识符）发送 给我们的服务器。我们不会将Cookie用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。有关详情，请参见AboutCookies.org。您可以清除计算机上保存的所有Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户社区 设置，但您可能因为该等修改，无法登录或使用依赖于Cookie的平台服务或功能。</view>
    <view>您可以通过更改您的浏览器设置限制我们对Cookie的使用。<span class="font-bold">以谷歌浏览器为例，您可以在浏览器右上方的下拉菜单的“浏览器设置”中，通过“隐私设置——清 除浏览数据”，选择清除您的Cookie。如需详细了解其他浏览器如何更改浏览器设置，请参考该浏览器的帮助中心或其他相关功能指引页面。</span></view>
    <view>三、我们如何共享、转让、公开披露您的个人信息</view>
    <view>(一) 共享</view>
    <view>除非经过您本人事先授权同意，我们不会向第三方共享、转让您的个人信息， 但经过匿名化处理（无法识别特定个人且不能复原）的除外。</view>
    <view>在下列情况下，经过您的授权同意，我们可能会共享的个人信息：</view>
    <view>1.广告、咨询类服务商/广告主。<span class="font-bold">在将您的个人信息与提供广告、咨询类服务商共享时，我们会征得您的授权同意。</span></view>
    <view class="font-bold">2.对我们与之共享个人信息的公司、组织和个人，我们会对其数据安全环境进 行调查，与其签署严格的保密协定，要求数据接收主体按照我们的说明、本隐私 政策以及其他任何相关的保密和安全措施来处理个人信息。</view>
    <view class="font-bold">3.我们可能会根据法律法规规定、诉讼及争议解决的必要，或按行政、司法机关 依法提出的要求，以及其他法定义务履行的必需，对外提供您的个人信息。如我们为履行法定义务而向第三方提供您的个人信息的，我们将记录相应的个人信息 提供行为。如您需了解您及您所提供个人信息的对外提供情况，您可通过电话、电子邮件等方式联系我们，我们在核实您的身份后将向您告知个人信息对外提供的有关信息。</view>
    <view class="font-bold">4.我们可能会将您的个人信息对外提供给经您同意的其他主体。</view>
    <view>您也可以利用平台的分享功能与您的特定或不特定社交好友（如微信）共享包括但不限于您浏览和搜索的内容、您发布的内容（包含文字、图片、视频和直 播）等。请您注意，您在使用第三方服务或分享功能的过程中，第三方对个人 信息的处理将适用该第三方服务商或对应社交平台的隐私政策。由于第三方原 因导致的个人信息权益受损，平台不承担任何责任。请您在分享前充分考虑信 息接收人的信誉情况，并建议您查看您利用的社交网络或第三方服务提供商的 隐私政策，以了解他们如何处理您的信息，以便审慎决策。</view>
    <view>(二) 转让</view>
    <view><span class="font-bold">我们不会将您的个人信息转让给除关联公司外的任何公司、组织和个人，</span>但以下情况除外：</view>
    <view>1. 事先获得您的明确授权或同意；</view>
    <view>2. 满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；</view>
    <view>3.如果我们或我们的关联公司涉及合并、分立、清算、资产或业务的收购或出 售等交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将告知您 个人信息接收方的姓名和联系方式，确保该等信息在转移时的机密性，并尽最大 可能确保新的持有您个人信息的公司、组织继续受此隐私政策的约束。我们将要 求该公司、组织重新向您征求授权同意。</view>
    <view>(三) 公开披露</view>
    <view>我们仅会在以下情况下，公开披露您的个人信息：</view>
    <view>1. 获得您的明确同意；</view>
    <view>2. 基于法律法规、法律程序、诉讼或政府主管部门强制性要求下。</view>
    <view>3.您违反法律法规或违反相关协议，可能对我们、用户或公众的人身财产权益 造成侵害，我们将依法</view>
    <view>(四) 共享、转让、公开披露个人信息时事先征得授权同意的例外</view>
    <view class="font-bold">在以下情形中，共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：</view>
    <view>1. 与国家安全、国防安全直接相关的；</view>
    <view>2. 与公共安全、公共卫生、重大公共利益直接相关的；</view>
    <view>3. 与犯罪侦查、起诉、审判和判决执行等直接相关的；</view>
    <view>4.出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
    <view>5. 个人信息主体自行向社会公众公开的个人信息；</view>
    <view>6.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</view>
    <view>(五) 我们所接入的第三方软件开发工具包（SDK）</view>
    <view><span class="font-bold">为了适配在不同手机设备上使用平台以及第三方平台服务，实现您的手机设备身 份认证、手机设备安全、接收信息推送、登录第三方平台账号、通过第三方平台 分享信息以及支付安全，平台接入了第三方SDK。上述第三方SDK提供方包括手 机设备厂商、社交平台、通讯运营商和第三方支付机构。</span>部分第三方<span class="font-bold">SDK</span>可能会 调用您的设备权限、获取您的相关信息，以便您在不同的手机设备或第三方平 台上正常使用相应功能。<span class="font-bold">不同的第三方SDK所调用的设备权限类型以及所获得的 信息可能不同，可能包括获取您的位置信息、读/写您的外部存储卡、读取您的 手机状态和身份、查看WLAN连接、检索正在运行的应用/蓝牙。</span>关于第三方SDK 具体调用的设备权限类型，以及如何收集、使用您的个人信息，建议您参考第三方SDK的相关服务协议及隐私政策。<span class="font-bold">如果您希望进一步了解我们所接入的第三方SDK情况，请您阅读本协议第三方软件开发工具包（SDK）相关内容。</span></view>
    <view>四、我们如何保存及保护您的个人信息</view>
    <view>(一) 保存期限</view>
    <view><span class="font-bold">您在使用平台产品及服务期间，我们将持续为您保存您的个人信息。如果您注销帐户或主动删除上述信息，我们将依据网络安全法等法律法规规定保存您的信息。</span>在您注销帐户或主动删除上述信息后，我们不会再对您的个人信息进行商业化使用，但我们可能会对您的个人信息进行匿名化处理后使用。</view>
    <view>(二) 保存地域</view>
    <view class="font-bold">您的个人信息均储存于中华人民共和国境内。如我们需要向境外传输您的个人信 息，我们会严格按照法律法规的规定执行，并保证您的个人信息安全。</view>
    <view>(二) 保存地域</view>
    <view class="font-bold">您的个人信息均储存于中华人民共和国境内。如我们需要向境外传输您的个人信息，我们会严格按照法律法规的规定执行，并保证您的个人信息安全。</view>
    <view>(三) 安全措施</view>
    <view>1. 我们会以业界通用安全标准和规范收集、使用、存储和传输用户信息，并通过用户协议和隐私政策告知您相关信息的使用目的和范围。</view>
    <view>2.我们非常重视信息安全。我们会采取适当的符合业界标准的安全措施和技术手段存储和保护您的个人信息，以防止您的信息丢失、遭到被未经授权的访问、公开披露、使用、修改、毁损、丢失或泄漏。 我们会采取一切合理可行的措施，保护您的个人信息。我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击。</view>
    <view>3. 我们会对员工进行数据安全的意识培养和安全能力的培训和考核，加强员工对于保护个人信息重要性的认识。</view>
    <view>4.我们提醒您注意，互联网并非绝对安全的环境，当您通过社交软件与其他用户交互信息时，不确定第三方软件对信息的传递是否完全加密，请注意确保您个人信息的安全， 我们建议您不要通过此类方式发送个人信息，以免个人信息泄露。请使用复杂密码，协助我们保证您的账号以及个人信息安全。</view>
    <view>5.我们也请您理解，在互联网行业由于技术的限制和飞速发展以及可能存在的各种恶意攻击手段，即便我们竭尽所能加强安全措施，也不可能始终保证信息的百分之百安全。请您了解， 您使用我们的产品和/或服务时所用的系统和通讯网络，有可能在我们控制之外的其他环节而出现安全问题。</view>
    <view>6. 在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处理措施、您可自主防范和降低的风险的建议、对您的补救措施等。我们将及时将事件相关情况以站内通知、短信通知、电话或邮件等您预留的联系方式告知您， 难以逐一告知时我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</view>
    <view>五、您的权利</view>
    <view class="font-bold">按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：</view>
    <view>(一) 访问、变更您的个人信息</view>
    <view class="font-bold">您可以通过如下方式访问您的个人信息：</view>
    <view>1. 访问、变更帐户信息（包括但不限于昵称、头像、性别、个性签名）：</view>
    <view><span class="font-bold">您可以登录</span>咓咔社群<span class="font-bold">APP，访问、变更您的帐户信息（包括但不限于性别、生日、手机号码、头像）。您还可以通过平台的【我的-个人账号】 行上述操作。</span></view>
    <view class="font-bold">当您发现我们处理的关于您的个人信息有错误时，您有权对错误或不完整的信息作出更正，经对您的身份进行验证后，您可以自行在平台内进行更正，或通过反馈与报错等将您的更正申请提交给我们。</view>
    <view>(二) 改变您授权同意的范围</view>
    <view class="font-bold">您可以随时给予或收回您的授权同意。</view>
    <view class="font-bold">1.当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也将不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的同意或授权而开展的个人信息处理。</view>
    <view>(三) 删除您的个人信息</view>
    <view class="font-bold">在以下情形中，您可以向我们提出删除个人信息的请求，可以通过【我的-官方客服】随时与我们联系：</view>
    <view>1.如果我们违反法律法规或与您的约定收集、使用、与他人共享或转让您的个人信息；</view>
    <view>2.如果我们违反法律法规规定或与您的约定，公开披露您的个人信息，您有权要求我们立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。</view>
    <view>当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。</view>
    <view>(四) 注销账号</view>
    <view>1. 您可以随时注销此前注册的帐号。</view>
    <view><span class="font-bold">您可以登录</span>咓咔社群，<span class="font-bold">注销您的平台帐号。</span></view>
    <view class="font-bold">路径： 您可以在平台移动端点击【我的】、点击【账号管理】、点击【注销帐号】，申请注销您的帐号。</view>
    <view class="font-bold">一旦您注销平台帐号，将无法使用需登陆帐号方可使用的平台公司产品及服务，因此请您谨慎操作。</view>
    <view>我们为了保护您或他人的合法权益会结合您对平台各产品和服务的使用情况判 断是否支持或允许您的上述请求。</view>
    <view class="font-bold">(五) 提前获知产品和服务停止运营权</view>
    <view>我们愿一直陪伴您，若因特殊原因导致平台产品和服务被迫停止运营，我们将在 产品或服务的主页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的 个人信息进行删除或匿名化处理等。</view>
    <view>(六) 响应您的上述请求</view>
    <view class="font-bold">为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。如您不满意，还可以通过平台移动端【我的-官方客服】联系我们。</view>
    <view>在以下情形中，按照法律法规要求，我们将无法响应您的更正、删除、注销信息的请求：</view>
    <view>1. 与国家安全、国防安全直接相关的；</view>
    <view>2. 与公共安全、公共卫生、重大公共利益直接相关的；</view>
    <view>3. 与犯罪侦查、起诉、审判和执行判决等直接相关的；</view>
    <view>4.我们有充分证据表明您存在主观恶意或滥用权利的（如您的请求将危害公共安全和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围）；</view>
    <view>5.响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；</view>
    <view>6. 涉及商业秘密的。</view>
    <view class="font-bold">六、我们如何处理未成年人的个人信息</view>
    <view class="font-bold">>我们非常重视对未成年人信息的保护。</view>
    <view class="font-bold">>对于使用平台产品和服务的未成年人，我们会采取额外保障措施以保护其个人信息。</view>
    <view class="font-bold">>我们的产品和服务主要面向成年人，若您是未满14周岁的未成年人，则不应在平台注册账号及使用任何服务；若您是未满14周岁的未成年人，在使用平台产品和服务前，应在您的父母或其他监护人监护、指导下共同仔细阅读本隐私政策，经监护人同意后，我们会收集和处理您的个人信息。</view>
    <view class="font-bold">>我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下收集、使用、公开披露未成年的个人信息。如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，将会采取措施尽快删除相关信息。</view>
    <view class="font-bold">>如果任何时候监护人有理由相信我们在未获监护人同意的情况下收集了未成年人的个人信息，请通过【我的-官方社群】联系我们，我们会采取措施尽快删除 相关数据。</view>
    <view>七、您的个人信息如何进行跨境转移</view>
    <view class="font-bold">>我们收集的您的个人信息将存储在中国境内，如涉及跨境我们会严格按照法律法规的规定执行，开展数据出境安全评估并保证您的个人信息安全。</view>
    <view>八、隐私政策的修订</view>
    <view class="font-bold">>我们的隐私政策可能变更。</view>
    <view class="font-bold">>未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本隐私政策所做的任何变更。</view>
    <view>对于重大变更，我们会在产品或服务的主要曝光页面或站内信或向您发送电子 邮件或其他合适的能触达您的方式通知您。若您不同意该等变更可以停止使用 平台产品和服务，若您继续使用我们的产品和/或服务，即表示您同意受修订后 的本隐私政策的约束。</view>
    <view class="font-bold">>本政策所指的重大变更包括但不限于：</view>
    <view>1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</view>
    <view>2. 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</view>
    <view>3. 个人信息共享、转让或公开披露的主要对象发生变化；</view>
    <view>4. 您参与个人信息处理方面的权利及其行使方式发生重大变化；</view>
    <view>5. 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</view>
    <view>6. 个人信息安全影响评估报告表明存在高风险时。</view>
    <view class="font-bold">>本政策更新后，我们会将本政策的旧版本存档，供您查阅。</view>
    <view>九、如何联系我们</view>
    <view class="font-bold">>您可以通过平台移动端【我的-官方客服】反馈您对平台产品的建议以及在使用 过程中遇到的问题，以帮助我们优化产品功能及服务，使更多用户更加便捷的使用我们的产品和服务。</view>
    <view class="font-bold">>如果您认为我们的个人信息处理行为损害了您的合法权益，您可以联系我们以保护您的权益；若双方就本协议发生争议，任何一方均有权向平台所在地有管辖权的人民法院提起诉讼。</view>
    <view class="font-bold">>附：名词解释</view>
    <view>1.个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人信息包括姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、帐号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。</view>
    <view>2. 个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。个人敏感信息包括身份证件号码、个人生物识别信息、 银行账号、通信记录和内容、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14岁以下（含）未成年人的个人信息等。</view>
    <view>3. 设备是指可用于使用平台产品和/或服务的装置，例如桌面设备、平板电脑或智能手机。</view>
    <view>4.设备信息可能包括您用于安装、运行【产品名称】SDK的终端设备的设备属性信息（例如硬件型号，操作系统版本及系统情况，设备配置，国际移动设备身份码IMEI、 国际移动用户识别码IMSI、 网络设备硬件地址MAC、广告标识符IDFA、供应商标识符IDFV、移动设备识别码MEID、匿名设备标识符OAID 、集成电路卡识别码ICCID 、Android ID、硬件序列号等设备标识符）、设备连接信息（例如浏览器的类型、电信运营商、使用的语言、WIFI信息）以及设备状态信息（例如设备应用安装列表）。</view>
    <view>5.位置信息是指通过GPS信息，WLAN接入点、蓝牙、基站以及其他传感器信息所获取的精确位置信息，也包括通过IP地址或其他网络信息等获取的粗略地理位置信息。</view>
    <view>6.唯一设备标识符是指具有唯一性的设备标识符（有时称为通用专属 ID 或 UUID）是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（例如国际移动设备身份码IMEI号、网络设备硬件地址MAC）。 不同的设备标识符在有效期、用户是否可以重置以及获取方式方面会有所不同。相应设备可能会有多个不同的具有唯一性的设备标识符。唯一设备标识符可用于多种用途， 其中包括安全性和欺诈检测、同步服务（如用户的电子邮件收件箱）、记录用户的偏好设置以及提供具有相关性的广告。</view>
    <view>7. Cookie是指支持服务器端（或者脚本）在客户端上存储和检索信息的一种机制，通过增加简单、持续的客户端状态来扩展基于Web的客户端/服务器应用。 服务器在向客户端返回HTTP对象的同时发送一条状态信息，并由客户端保存。状态信息中说明了该状态下有效的URL范围。此后， 客户端发起的该范围内的HTTP请求都将把该状态信息的当前值从客户端返回给服务器，这个状态信息被称为Cookie。</view>
    <view>8. 匿名标示符是指平台基于设备参数，通过机器算法，生成一个标示符例如BAIDUID、CUID，帮助平台识别一个用户，为其提供更好的产品和/或服务与改善用户体验。</view>
    <view>9. 匿名化是指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。个人信息经匿名化处理后所得的信息不属于个人信息。</view>
    <view>10. 关联公司是指其他与我司存在关联关系的公司的单称或合称。“关联关系”是指对于任何主体（包括个人、公司、合伙企业、组织或其他任何实体）而言，即其直接或间接控制的主体， 或直接或间接控制其的主体，或直接或间接与其受同一主体控制的主体。前述“控制”指，通过持有表决权、合约或其他方式， 直接或间接地拥有对相关主体的管理和决策作出指示或责成他人作出指示的权力或事实上构成实际控制的其他关系。</view>
    <view>再次感谢您对咓咔社群的信任和使用！</view>
    <view class="text-right">上海格乐喜网络信息科技有限公司 </view>
    <view class="text-right">2024年11月21日生效</view>
    
    
    
    
    
    
  </view>
</template>

<script setup>
  import {ref} from 'vue'
  import uniTable from '@/components/uni-table/components/uni-table/uni-table.vue'
  import uniTd from '@/components/uni-table/components/uni-td/uni-td.vue'
  import uniTh from '@/components/uni-table/components/uni-th/uni-th.vue'
  import uniTr from '@/components/uni-table/components/uni-tr/uni-tr.vue'
  
  const tableWidth = ref(uni.upx2px(150))
</script>

<style lang="scss" scoped>
  .wrapper {
    padding: 88rpx 32rpx;
    background-color: #ffffff;
    // font-family: MiSans, MiSans;
    view {
      margin-bottom: 20rpx;
      font-weight: 400;
      font-size: 32rpx;
      color: rgba(0,0,0,0.8);
      line-height: 48rpx;
    }
    .mt32 {
      margin-top: 60rpx;
    }
    .title {
      font-weight: 700;
      font-size: 40rpx;
      color: #000000;
      line-height: 40rpx;
      text-align: center;
    }
    .text-right {
      text-align: right;
    }
    .text-indent {
      text-indent: 66rpx;
    }
    .font-bold {
      font-weight: bold;
    }
  }
  .tableList {
    view {
      margin: 0;
    }
    // margin: 18rpx 30rpx;
    border: 1px solid #dee2e5;
    // border-top: none;
    // border-bottom: none;
    :deep .uni-table-th {
      font-size: 24rpx;
      line-height: 1.2;
      font-weight: 400;
      color: #606178;
      background-color: #F4F5F7;
      border-right: 1px #dee2e5 solid;
      &:last-of-type {
        border-right: none;
      }
    }
    :deep .uni-table-tr {
      .size {
        font-size: 24rpx;
        color: #0E1B2E;
      }
      .uni-table-td {
        font-size: 24rpx;
        color: #0E1B2E;
        border-right: 1px #dee2e5 solid !important;
        // border-color: #dee2e5 !important;
        &:last-of-type {
          border-right: none !important;
        }
      }
      &:last-of-type {
        .uni-table-td {
          border: none;
        }
      }
    }
  }
  
</style>