<template>
  <view class="wrapper">
    <view class="title">咓咔社群公约</view>
    <view>内容公约：</view>
    <view>在咓咔社群平台内，禁止发布以下内容：</view>
    <view>1、法律法规明确禁止的信息内容；</view>
    <view>2、时政、不实信息；</view>
    <view>3、涉未成年人违规信息；</view>
    <view>4、淫秽、暴力信息；</view>
    <view>5、涉及赌博或者教唆犯罪的内容；</view>
    <view>6、法定禁止的金融信息内容；</view>
    <view>7、诈骗信息；</view>
    <view>8、使用技术手段批量制造的虚假账号发布的信息；</view>
    <view>9、侵害他人人身权益、知识产权的信息及行为</view>
    <view>咓咔社群的内容会经过人工和系统审核，一经发现违规内容，将会根据违规的严重程度，采取如下措施：</view>
    <view>1、内容处理：删除、屏蔽、限制展示、标注等；</view>
    <view>2、帐号处理：禁止发布内容、封禁账号等；</view>
    <view>3、社群处理：限制加入、限制内容发布、删除频道、解散群等。</view>
    <view>群主管理原则：</view>
    <view>1.群的管理权归群主所有，群主有权利和义务管理好群，原则上咓咔社群工作人员不会介入群的日常运营；</view>
    <view>2.群内部之间的争执由群内成员和群管理员协商解决，咓咔社群工作人员不参与处理此类事件；若群内存在不和谐、不友善的内容，咓咔社群可参照下面“个人群准则”对相关群的推广进行限制；</view>
    <view>3.群与群之间产生的分歧、争执由用户自行解决，咓咔社群工作人员不参与处理此类事件；若群内存在不和谐、不友善的内容，咓咔社群可参照下面“个人群准则”对相关群的推广进行限制；</view>
    <view>群主须知及免责声明：</view>
    <view>1.群的主题或群内内容如违反了《用户协议》中第五点的平台管理规则，如群管理员不及时删除，咓咔社群工作人员有权进行处理（包括但不限于封禁违规账号、封禁群管理、封禁群、解散群等）</view>
    <view>2.群主严禁出售、出租群，如有相关证据，咓咔社群工作人员有责权对其进行处理（包括但不限于解散群、封禁群主等）；</view>
    <view>3.遇到特殊情况或政府相关机构要求时，咓咔社群保留处置或解散任何群的权利。</view>
    <view>4.群内可能存在来自他人包括威胁性的、诽谤性的、令人反感的或非法的内容或行为，或侵犯他人权利（包括知识产权）的匿名或冒名的信息风险，用户须承担以上风险，咓咔社群对服务不作担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。若群内存在以上的内容，咓咔社群可参照下面“个人群准则”对群的推广进行限制；</view>
    <view>5.用户使用咓咔社群服务必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于用户违法或违反本协议的使用(包括但不限于言论发表、传送等)而引起的一切后果，咓咔社群将不承担任何责任。</view>
    <view>个人群准则：</view>
    <view>我们倡导这样的群：</view>
    <view>1.群的主题和群的简介清晰明了：更好帮助新人了解加入群的好处。</view>
    <view>2.设立群的规章制度并在群内公布：清楚列出群内允许和不允许的行为以及处罚；</view>
    <view>3.设立群的管理团队：管理员可以帮助您共同监督群内的违规行为，同时可以帮您建立良好的群内文化。</view>
    <view>我们不倡导这样的群：</view>
    <view>1.不和谐的主题和内容：如攻击谩骂、阴阳怪气、煽动引战、抹黑造谣。</view>
    <view>2.长时间不对群进行运营：在吸引到用户加入后，不对群内进行管理运营，任由群荒废；</view>
    <view>3.放纵用户：不对群内用户的恶性言行进行约束和管理。</view>
    <view>违反上述准则的群将有可能被取消推广和发现资格（取消推广资格表现为不能转发任何群内内容到其他群，取消发现资格表现为不能在发现频道里出现，不能被主动搜索到）</view>
    <view>本《协议》的版权由咓咔社群所有，咓咔社群保留一切解释和修改的权利。</view>
  </view>
</template>

<script>
</script>

<style lang="scss" scoped>
  .wrapper {
    padding: 88rpx 32rpx;
    background-color: #ffffff;
    // font-family: MiSans, MiSans;
    view {
      margin-bottom: 20rpx;
      font-weight: 400;
      font-size: 32rpx;
      color: rgba(0,0,0,0.8);
      line-height: 48rpx;
    }
    .mt32 {
      margin-top: 60rpx;
    }
    .title {
      font-weight: 700;
      font-size: 40rpx;
      color: #000000;
      line-height: 40rpx;
      text-align: center;
    }
    .text-right {
      text-align: right;
    }
    .text-indent {
      text-indent: 66rpx;
    }
    .font-bold {
      font-weight: bold;
    }
  }
</style>