<template>
  <view class="wrapper">
    <scroll-view scroll-y="true" >
      <view class="title">
        咓咔社群软件许可及用户协议
      </view>
      <view class="content">
        <view  class="text-right mt32">生效时间：2024年11月21日</view>
        <view class="text-indent">《咓咔社群软件许可及用户协议》（以下简称“本协议”）由您（以下或称“用户”）与深圳市乐逗科技有限责任公司（以下简称“本公司”或“我们”）共同缔结，本协议具有合同效力。<span class="font-bold">为保障您的合法权益，请您在同意并接受本协议所有条款前务必审慎阅读、充分理解各条款内容，特别是免除或限制本公司责任的条款（以下称“免责条款”）、对您的权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款。</span></view>
        <view class="text-indent">前述免责、限制及争议解决方式及其他重要条款将以黑体加粗的方式或其他合理方式提示您注意，您对该等条款的确认有可能导致您在特定情况下的被动、不便、损失，请您在确认同意本协议之前或在使用本公司软件服务之前务必阅读前述条款。</view>
        <view class="text-indent">如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并在取得监护人对您使用本服务的行为的同意，方可使用本软件。如您为未成年人的法定监护人，请特别注意第8条。</view>
        <view class="text-indent">如果您对本协议或本服务有任何意见或建议，可与本协议中约定的本公司客户服务部门联系，我们会给予您帮助。<span class="font-bold">一旦您点击“同意”键、“接受”键或以安装、使用、注册或其他方式访问本服务，即视为您已详细阅读理解了本协议的全部内容，并同意遵守本协议的规定，所以请您务必在点击操作前仔细、完整地阅读本协议。</span></view>
        <view class="font-bold">1 定义</view>
        <view>1.1 本协议：指《咓咔社群软件许可及用户协议》、《咓咔社群个人信息保护政策》以及本公司在本软件中已经发布的或将来可能发布、更新的与本服务有关的规则、公约。</view>
        <view>1.2 本软件：本公司开发并按照本协议授权您下载、安装、使用的《咓咔社群》软件，包含客户端、移动端内容及程序，并可能包括相关网络服务器、网站、电子媒体、印刷材料和“联机”或电子文档。</view>
        <view>1.3 本服务：指本公司通过本软件向您提供的相关服务，具体服务内容以本公司在本软件中提供的为准。您知晓并同意，本公司可能会根据需要更新本服务的内容。</view>
        <view>1.4 用户（您）：指通过本公司提供的合法途径获得本软件使用许可而安装、使用本软件及接受本服务的自然人。</view>
        <view class="font-bold">2 协议的生效和变更</view>
        <view>2.1 <span class="font-bold">在您安装、使用或以其他方式访问本软件的同时，您需同意遵守本协议。如果您不同意遵守本协议，请勿安装、使用或以其他方式访问本软件。本公司保留在您不同意本协议的情况下拒绝为您提供本服务的权利。</span></view>
        <view>2.2 <span class="font-bold">本公司有权决定变更（包括但不限于修改、增加或删减）本协议。您如果继续使用本服务，则视为您接受上述变更。如果您届时不同意变更后的本协议中的全部或部分内容，请您立即停止使用本服务，您与本公司形成的合同关系将终止。</span></view>
        <view class="font-bold">3 软件账号</view>
        <view>3.1 您在使用本服务前需要注册一个软件账号。软件账号可通过手机号码进行注册。您不得赠与、借用、租用、转让、售卖软件账号或者以其他方式许可他人使用您的软件账号，亦不得通过受赠、继承、承租、受让或其他任何方式使用他人注册的软件账号。<span class="font-bold">否则，本公司有权对相关软件账号采取包括但不限于警告、限制或禁止使用软件账号全部或部分功能、删除软件账号及软件数据及其他相关信息、封禁软件账号（“封号”）、注销账号等处理措施，由此造成的一切后果由您自行承担。</span></view>
        <view>3.2 本软件中部分服务或功能需要您进行实名认证，如您需要获得该部分服务或实现该部分功能，您应按照页面提示完成实名认证程序，包括但不限于输入正确完整的基本资料和信息。如您不进行实名认证，或您提供的认证信息是不完整的，则您在使用本软件过程中可能会受到相应限制。<span class="font-bold">您在进行实名认证时，应提供有关您本人真实、合法、准确、有效的身份信息，且不得以他人身份资料进行实名认证并接受相关服务，否则，本公司有权终止为您提供本服务，并有权对您的软件账号采取包括但不限于警告、限制或禁止使用软件账号全部或部分功能、删除软件账号及软件数据、删除相关信息、封号、注销账号等处理措施，由此造成的一切后果由您自行承担，如您的行为造成本公司损失的，本公司保留要求您赔偿所有损失的权利。</span>您进行实名认证后，基于合理理由需要修改个人身份信息的，本公司在通过对您个人身份信息的验证比对后，将及时、有效地为您提供该项服务。</view>
        <view>3.3 为了维护您的合法权益，您在向本公司提供与您注册的身份信息相一致的个人有效身份信息后，您有权以书面形式要求本公司提供本人账号注册人证明、原始注册信息等必要的协助和支持 ，本公司在核查您要求的合法性及合理性后，将在合理范围里给予您相应协助或拒绝您的要求，同时将根据您的书面请求向有关行政机关和司法机关提供相关证据信息资料，<span class="font-bold">但对于您反复多次的请求所带来的费用支出，本公司有权要求您承担。</span></view>
        <view>3.4 您充分理解并同意，本公司有权审查您提供的身份信息是否真实、有效，以便采取技术与管理等合理措施保障您软件账号的安全、有效。您应妥善保管您的软件账号及账号内设置的密码，您应在知晓您的软件账号被盗用后第一时间通知本公司。<span class="font-bold">您应以正确、安全的方式使用您的账号及密码，如您未能以正确、安全的方式使用您的账号及密码，导致账号密码遗失、账号被盗等情形而给本公司或他方的权益造成损害的，应承担由此产生的法律责任。</span>若您发现有他人冒用或盗用您的软件账号及密码、或任何其他未经您合法授权使用您的软件账号的情形时，请您立即通过客服电话或邮箱通知本公司，告知本公司需采取的措施。您通知本公司时，应提供与您账号信息相一致的个人有效身份信息，本公司收到您的有效请求并核实身份后，会根据您的要求或结合具体情况采取相应措施（包括但不限于暂停该账号的登录和使用等），<span class="font-bold">本公司因根据您的请求采取相应措施而造成您及其他用户损失的后果，将由您承担全部责任。</span>如您通知本公司后，本公司未及时采取相应措施暂停您账号的登录和使用并给您造成损失的，本公司仅承担损失扩大部分的相应责任。<span class="font-bold">若您没有提供有效身份信息或您提供的有效身份信息无法核实的，本公司有权拒绝您的请求，因此造成的损失将由您自行承担。</span></view>
        <view>3.5 您充分理解并同意，为提高本服务的安全水平 ，本公司有权将有关技术或软件应用到本软件中，但本公司不保证这些安全保障措施可以完全杜绝软件账号被他人窃取或丢失的风险。</view>
        <view>3.6 <span class="font-bold">您充分理解并同意，为高效利用服务器资源，如果您三年未使用软件账号登录本软件，本公司有权视需要，在提前通知您的情况下，对该软件账号及其账号下的软件数据及相关信息采取删除等处置措施，上述处置可能导致您对该软件账号下相关权益的丧失，对此本公司不承担任何责任。</span></view>
        <view>3.7 您有权注销您的软件账号。软件账号一旦注销完成，将无法恢复，请您谨慎进行软件账号注销操作。请您特别注意，<span class="font-bold">在您的软件账号注销后，将会产生如下后果，您需要自行承担：</span></view>
        <view>（1）您将无法再以此软件账号登录和使用本软件及相关服务；</view>
        <view>（2）除法律法规或本公司另有规定，<span class="font-bold">您在该软件账号下的所有内容、数据、信息、记录（包括但不限于头像、昵称、社区列表）将进行删除或匿名化处理，您无法再检索、访问，也无权要求我们找回。</span>如您的软件账号曾因违反国家相关法律法规及（或）本公司相关规定被采取封号及（或）其他处理措施的，为了维护您及其他相关权利人的合法权益所必须，在您软件账号注销后我们可能会对与该账号违规行为有关的数据保留3年。在保留期限内，我们除将该数据用于维护您及其他相关权利人的合法权益外，不会用于其他目的 。</view>
        <view>（3）<span class="font-bold">该软件账号下的相关资产、资金、收益、虚拟财产等权益（包括但不限于尚未使用的虚拟道具及其他虚拟物品、账号余额、打赏获得的收入余额）也将会被清除。据此，在您注销软件账号前请您确保已妥善处理该软件账号下的权益或相关权益已结清，否则由此产生的后果您应自己承担，您同意不会要求以此要求我们恢复或赔偿。</span></view>
        <view>（4）软件账号一旦注销，您与我们签署的有关本软件的全部服务协议及其他有关协议将一并终止，但该等协议的终止并不影响您对该软件账号注销前使用本软件的行为承担相应责任，包括但不限于可能产生的违约责任、损害赔偿责任等。</view>
        <view class="font-bold">4 用户信息收集、使用及保护</view>
        <view>4.1 尊重及保护用户个人信息和隐私是本公司的一项基本原则。本公司承诺，本服务对用户个人信息的收集 、存储 、使用、共享、转让 、公开披露、删除等个人信息处理活动将遵循《咓咔社群个人信息保护政策》。</view>
        <view class="font-bold">5 软件服务</view>
        <view>5.1 软件安装与卸载</view>
        <view>5.1.1 使用本软件可能需要下载并安装相关软件，请您直接从本公司的相关网站上获取本软件，或从得到本公司授权的第三方获取本软件。如果您从未经本公司授权的第三方获取本软件或与本软件名称相同的软件，将视为您未获得本公司授权，<span class="font-bold">本公司无法保证该软件能够正常使用，且对您因此遭受的损失不承担责任。</span></view>
        <view>5.1.2 本公司可能为不同的终端设备或操作系统开发了不同的软件版本，包括但不限于Windows、iOS、Android、Windows Phone、Symbian、Blackberry等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。</view>
        <view>5.1.3 如果您不再需要使用本软件或需要安装本软件的最新版本，可以自行卸载。如果您愿意帮助本公司改进本软件或本服务，请告知我们卸载的原因。</view>
        <view>5.2 软件更新</view>
        <view>5.2.1 为提供更加优质、安全的服务，本公司会不时提供本软件的更新（包括但不限于本软件的替换、修改、功能强化、版本升级等）。</view>
        <view>5.2.2 <span class="font-bold">为了保证本软件及本服务的安全性和功能的一致性，本公司有权不经向您特别通知而对本软件进行更新，或者对本软件的部分功能、工具、效果等本软件内容及本服务进行改变或限制，您不得以此追究本公司的责任。</span>如您不同意有关更新的内容，您有权单方面立即停止使用并卸载本软件。<span class="font-bold">如您在本软件更新后继续使用本软件和本服务的，即视为您同意接受更新内容。</span></view>
        <view>5.2.3 <span class="font-bold">本软件新版本发布后，本软件的旧版本可能无法使用。本公司不保证本软件的旧版本及相应的服务继续可用，请您随时核对并下载最新版本。</span></view>
        <view>5.3 为使用本软件，您应自行配合上网所需要的设备，包括个人电脑、调制解调器、移动设备或其他上网装置，并自行负担使用本服务过程中产生的电话费用、网络费用。</view>
        <view>5.4 <span class="font-bold">您理解并同意，您在使用本软件某一特定服务时，本公司可以使用您终端设备的相关权限、接口及信息等以实现相应的功能。我们还针对某些特定服务制定了单独的协议、规则等，您在使用该项特定服务之前请仔细阅读相关协议、规则，如您使用前述特定服务，即视为您已接受相关协议、规则。</span></view>
        <view>5.5 本公司和/或关联公司、合作伙伴将根据市场与技术的发展，向您提供与本软件相关的各种互联网以及移动通信增值服务，包括免费和收费的增值服务。本公司和/或关联公司、合作伙伴保留对相关增值服务收取费用及改变收费标准、方式的权利；如相关服务由免费变更为收费服务，本公司和/或关联公司、合作伙伴将以适当的形式进行通知，您可自主选择接受或拒绝该等收费服务。</view>
        <view>5.6 本公司向您提供软件服务本身属于商业行为，您有权自主决定是否根据本公司自行确定的收费项目（包括但不限于购买软件内的虚拟道具的使用权以及接受其他增值服务等各类收费项目）及收费标准支付相应的费用，以获得相应的软件服务。如您不按照相应标准支付相应费用的，您将无法获得相应的软件服务。您知悉并同意：<span class="font-bold">本公司有权自主决定本软件及本服务的收费方式和资费标准，收费项目或收费标准的改变、调整是一种正常的商业行为，您无权因为收费项目或收费标准的改变、调整而要求本公司进行赔偿或补偿。</span></view>
        <view>5.7 您充分理解并同意：为了保证您及其他用户的软件使用体验，本公司有权定期转移或者清除本软件服务器上存储的一些过往的软件数据。</view>
        <view>5.8 本公司有权自行决定终止运营本公司软件。本公司会按照相关法律法规的规定处理软件终止运营相关事宜，以保障用户合法权益。</view>
        <view class="font-bold">6 软件许可</view>
        <view>6.1 在您遵守本协议及相关法律法规的前提下，本公司给予一项您个人的、可撤销的、可变更的、不可转让、不可再授权及非排他性的许可，以使用本软件。您仅能以非商业目的使用本软件，包括：</view>
        <view>6.1.1 接收、下载、安装、启动、升级、登录、显示、运行和截屏本软件；</view>
        <view>6.1.2 创建软件账号，设置账号名称，查阅本软件规则，设置个人资料，在本软件中购买、使用虚拟道具、虚拟礼物，使用聊天功能、社交分享功能；</view>
        <view>6.1.3 使用本软件支持并允许的其他某一项或几项功能。</view>
        <view>6.1.4 本条及本协议其他条款未明示授权的其他一切权利仍由本公司保留，您在行使这些权利时须另外取得本公司的书面许可。</view>
        <view>6.2 如您有需要在个人使用的范围以外使用本软件及本服务，或者将本软件与本服务用于任何商业用途，则应与本公司联系并获得本公司另行授权。任何未经本公司许可的安装、使用、访问、显示、运行、商业使用本软件或本服务等行为均属对本公司的侵权。</view>
        <view>6.3 在遵守本协议的前提下，您可以在单一一台终端设备上安装、使用、显示、运行本软件的一份副本。</view>
        <view>6.4 您充分理解并同意：虚拟道具、虚拟礼物等是本服务的一部分，本公司在此许可您依本协议而获得其使用权。您购买、使用虚拟道具、虚拟礼物等应遵循本协议或特定服务协议的规则及要求，如根据本软件中特定服务协议或特定功能规则，<span class="font-bold">虚拟道具、虚拟礼物等受到有效期限的限制，那么除不可抗力或可归责于本公司的原因外，一旦有效期届满，会自动失效，如本软件终止运营的，该有效期截止到运营终止之日。</span></view>
        <view>6.5 您仔细阅读并接受本协议条款，且完成相应的安装程序后，便成为本软件的使用者。您了解并同意，只有在遵守本协议全部约定的情况下，您方可使用本软件及本服务。</view>
        <view>6.6 您拥有在未经事先通知本公司的情况下，自行中断或终止本软件使用、卸载本软件的权利。您应知悉，本软件卸载后您将无法再使用本软件功能及相关服务。</view>
        <view class="font-bold">7 第三方产品和服务</view>
        <view>7.1 您理解并同意，本公司有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方作推广等，本公司承诺在推广过程中严格按照《咓咔社群个人信息保护政策》的约定保护您的个人信息。</view>
        <view>7.2 本公司有权在本软件中或通过本服务投放各种广告和宣传信息，该等第三方可能通过本软件向你提供产品或者服务，任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和该等第三方之间发生，您应审慎决定是否接受该等第三方的产品或服务，<span class="font-bold">本公司不为这类第三方产品或服务负任何责任。另外，您在使用该等第三方提供的产品或服务时，需遵守第三方的用户协议，本协议不适用于该等第三方提供的产品或服务。</span></view>
        <view>7.3 第三方在本软件中投放的广告、链接或者其它形式的推广内容，均是由自行提供的，本公司基于目前的技术水平无法逐一核查广告内容的风险，请您务必仔细核实广告内容的真实性、合法性，<span class="font-bold">本公司对其推广内容不作任何明示或者默示的担保，您未尽注意义务产生的法律后果将由您自行承担。</span></view>
        <view>7.4 您使用本软件或要求本公司提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持您的使用或访问，使用或访问的结果由该第三方提供，本公司不保证第三方服务及内容的安全性、准确性、有效性，由此若引发的任何争议及损害，本公司和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。</view>
        <view class="font-bold">8 未成年人使用规则</view>
        <view>8.1 <span class="font-bold">本公司非常重视对未成年人个人信息的保护，18周岁以下的未成年人未经法定监护人同意不得使用本软件。</span>如您是18周岁以下的未成年人的法定监护人，则应监督和管控该未成年人使用本软件的行为，该未成年人创建账号、付费充值等行为应通过您的事先同意。</view>
        <view>8.2 本公司将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用本软件过程中的合法权益。作为本协议的一部分，本公司还将在适当位置发布社区公约、用户指引、警示说明等软件使用规则，包括软件内容介绍、正确使用软件的方法以及防止危害发生的方法。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照、执行这些规则；其他用户在使用本软件的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康软件环境。</view>
        <view>8.3 如您是未成年人，<span class="font-bold">为保障您的合法权益，本公司有权依据国家有关法律法规及政策规定、本协议规定或根据您的法定监护人的合理要求采取以下一种或多种措施：</span></view>
        <view>8.3.1 <span class="font-bold">将与您使用软件相关的信息（包括但不限于软件账号的登录信息、充值信息等）提供给您的法定监护人，使您的法定监护人可及时或同步了解您的软件使用情况；</span></view>
        <view>8.3.2 <span class="font-bold">限制您软件账号的消费额度；</span></view>
        <view>8.3.3 <span class="font-bold">采取技术措施屏蔽某些内容或某些功能，或限定您对某一功能的使用时长；</span></view>
        <view>8.3.4 <span class="font-bold">注销或删除您软件账号及软件数据等相关信息；</span></view>
        <view>8.3.5 <span class="font-bold">根据法定监护人要求采取的，或本公司认为可采取的其他合理措施，以限制或禁止您使用本软件。</span></view>
        <view class="font-bold">9 用户行为规范</view>
        <view>9.1 您充分了解并同意：您除了对登录后所持账号产生的行为依法享有权利外，您还必须为自己软件账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本公司软件中的内容自行加以判断，并承担因使用本软件而引起的所有风险，包括因对本软件的正确性、完整性或实用性的依赖而产生的风险。本公司无法且不会对因前述风险而导致的任何损失或损害承担责任。</view>
        <view>9.2 您除了可以按照本协议的约定使用本软件之外，不得进行任何侵犯本软件的知识产权的行为，或者进行其他的有损于本公司或其他第三方合法权益的行为。</view>
        <view>9.3 您在使用本软件时须遵守法律法规，不得利用本软件或本服务实施下列违法违规行为，一经发现，本公司有权采取包括但不限于删除您发布的内容、暂停或终止对您提供本服务、清除您软件账号的信息等措施，且本公司对此不承担任何责任：</view>
        <view>9.3.1 实施违法违规的行为或发布、传播含有违法违规内容的信息：</view>
        <view>（1）违反宪法确定的基本原则的；</view>
        <view>（2）危害国家安全，泄露国家机密，颠覆国家政权，破坏国家统一、主权和领土完整的；</view>
        <view>（3）损害国家荣誉和利益的；</view>
        <view>（4）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；</view>
        <view>（5）破坏国家宗教政策，宣扬邪教、封建迷信的；</view>
        <view>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</view>
        <view>（7）宣扬淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</view>
        <view>（8）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序，或以非法民间组织名义活动的；</view>
        <view>（9）其他违反法律、行政法规或公序良俗的行为或含有违反法律、行政法规或公序良俗的内容；</view>
        <view>9.3.2 实施侵害他人合法权益的行为：</view>
        <view>（1）羞辱、谩骂、攻击、骚扰、恐吓、威胁、侮辱、诽谤其他用户或发布任何对其他用户造成严重影响的内容；</view>
        <view>（2）煽动用户攻击、孤立或不友善地对待其他用户；</view>
        <view>（3）发布含有民族、种族、宗教、性取向、性别、年龄、地域、生理特征等歧视、侮辱、攻击性质的内容；</view>
        <view>（4）未经他人授权，擅自使用他人享有著作权的作品或通过任何其他方式侵犯他人知识产权；</view>
        <view>（5）泄露他人隐私；</view>
        <view>（6）其他侵害他人合法权益的行为；</view>
        <view>9.3.3 违法违规推广：</view>
        <view>（1）以发布广告、提供链接等形式推广、宣传、销售任何国家法律法规禁止或限制销售的商品或服务，或未经本公司认可的产品、服务；</view>
        <view>（2）通过不同软件账号之间的虚假互动推广、宣传、销售任何国家法律法规禁止或限制销售的商品或服务，或未经本公司认可的产品、服务；</view>
        <view>（3）通过使用特殊符号、图片等方式规避推广内容审核；</view>
        <view>9.3.4 实施扰乱软件使用环境的行为：</view>
        <view>（1）冒充他人，通过头像、昵称等个人信息暗示自己与他人或机构等同或相关；</view>
        <view>（2）重复发布干扰用户的内容，包括但不限于：重复多次发布内容相似的信息，频繁发布难以辨识、影响阅读的字符或无意义的乱码，以评论、@、私信等方式骚扰其他用户，发布容易引起不适的内容（如密集恐惧等）；</view>
        <view>（3）制作及传播外挂或宣传破坏游戏平衡性的工具；</view>
        <view>（4）发布含有潜在危险的内容，如钓鱼网站、病毒网站、木马等；</view>
        <view>（5）恶意对抗行为，包括但不限于使用变体、谐音等方式规避安全审查。</view>
        <view>9.4 除非法律允许或本公司书面许可，您从事下列用户不正当、禁止性行为时，本公司有权终止对您提供服务并要求您承担相应法律责任：</view>
        <view>9.4.1 删除本软件及其副本上关于著作权的信息；</view>
        <view>9.4.2 对本软件进行反向工程、反向汇编、反向编译或者以其他方式尝试发现本公司软件的源代码；</view>
        <view>9.4.3 对本软件进行扫描、探查、测试，以检测、发现、查找其中可能存在的BUG或弱点；</view>
        <view>9.4.4 对本软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；</view>
        <view>9.4.5 修改或伪造本软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；</view>
        <view>9.4.6 通过非本公司开发、授权的第三方软件、插件、外挂、系统，使用本公司软件及本公司软件服务，或制作、发布、传播非本公司开发、授权的第三方软件、插件、外挂、系统；</view>
        <view>9.4.7 对本软件中本公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</view>
        <view>9.4.8 建立有关本软件的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与本软件服务完全相同或者类似的软件或服务；</view>
        <view>9.4.9 将本公司软件的任意部分分离出来单独使用，或者进行其他的不符合本协议的使用；</view>
        <view>9.4.10 使用、修改或遮盖本软件的名称、商标或其它知识产权；</view>
        <view>9.4.11 提供虚假身份信息进行注册、认证、充值等行为；</view>
        <view>9.4.12 其他未经本公司明示授权的行为。</view>
        <view>9.5 您在使用本软件过程中有如下任何行为的，本公司有权视情节严重程度，依据本协议的规定，对您做出暂时或永久性地封号、删除软件账号及软件数据、无偿收回虚拟道具、删除相关信息等处理措施，且本公司保留追究您的法律责任的权利：</view>
        <view>9.5.1 以某种方式暗示或伪称本公司内部员工或某种特殊身份，企图得到不正当利益或影响其他用户权益的行为；</view>
        <view>9.5.2 在本软件中使用非法、不当或违反公序良俗的词语、字符等，包括用于账号名称；</view>
        <view>9.5.3 以任何方式破坏本软件或影响本服务的正常进行；</view>
        <view>9.5.4 各种非法外挂行为；</view>
        <view>9.5.5 传播非法言论或不当信息；</view>
        <view>9.5.6 盗取他人软件账号、虚拟道具；</view>
        <view>9.5.7 私自进行软件账号交易；</view>
        <view>9.5.8 私自进行虚拟道具等交易；</view>
        <view>9.5.9 违反本协议任何约定的；</view>
        <view>9.5.10 其他在行业内被广泛认定的不当行为，无论是否已经被本协议明确列明。<span class="font-bold">您知悉并同意，由于外挂具有隐蔽性或用完后即消失等特点，本公司有权根据您的软件数据和表现异常判断您有无使用非法外挂等行为。</span></view>
        <view>9.6 <span class="font-bold">您知悉并同意，如本公司依据本协议对您的软件账号采取封号处理措施的，具体封号期间由本公司根据您违规行为情节而定。您知悉并同意：</span></view>
        <view>9.6.1 <span class="font-bold">在封号期间，您软件账号中的虚拟道具、虚拟礼物可能都将无法使用；</span></view>
        <view>9.6.2 <span class="font-bold">如前述虚拟道具、虚拟礼物存在一定有效期，该有效期可能会在封号期间过期，您软件账号解封后，您将无法使用该等已过期的虚拟道具、虚拟礼物。据此，您无权追究本公司的法律责任。</span></view>
        <view>9.7 <span class="font-bold">如果本公司发现或收到他人举报或投诉您违反本协议约定，本公司有权采取相应的措施进行处理，该措施包括但不限于：不事先通知您的情况下对相关内容进行删除，并视行为情节对违规软件账号处以包括但不限于警告、限制或禁止使用全部或部分功能、封号直至注销的处罚，并公告处理结果，同时有权要求您赔偿因您从事违约行为而给本公司造成的损失等。</span></view>
        <view>9.8 您充分理解并同意，本公司有权依合理判断对违反有关法律、法规、部门规章规定、行政机关的通知或本协议规定的行为进行处理，对违法、违规、违约的用户采取适当的法律措施，并依法依规保存有关信息向有关部门报告等，您应承担由此而产生的法律责任。</view>
        <view>9.9 您充分理解并同意，如您因违反本协议规定，导致或产生第三方主张向您或本公司主张的赔偿或其他权利的责任将由您独自承担，本公司因此遭受损失的，有权要求您赔偿。</view>
        <view class="font-bold">10 免责声明</view>
        <view>10.1 <span class="font-bold">本服务以“现状”提供给您。本公司不保证：本软件无错误及不会中断、所有缺陷已被更正、或本软件不会受到病毒或任何其它因素的损害。除非有法律明确规定，基于现有技术条件等限制，本公司在此明确声明不承担任何明示或默示的担保责任，包括但不限于对本软件的性能、适用性或不侵权的担保。</span></view>
        <view>10.2 本软件可能因BUG、版本更新缺陷、第三方病毒攻击或其他因素导致您的账号数据发生异常。<span class="font-bold">在数据异常的原因未得到查明前，本公司有权暂时冻结该软件账号；若查明数据异常为非正常软件使用行为所致，本公司有权恢复软件账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），且本公司无须向您承担责任。</span></view>
        <view>10.3 <span class="font-bold">在任何情况下，本公司不对因不可抗力导致的您在使用本软件过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家 法律、法规、政策及国家机关的命令及其他政府行为或者其它的诸如地震、水灾、雪灾、火灾、海啸、台风、罢工、战争、黑客攻击等不可预测、不可避免且不可克服的事件。</span></view>
        <view>10.4 如您从未经本公司授权的第三方处购买、接受赠与或者通过其他的方式获得软件账号、虚拟道具的，<span class="font-bold">本公司不对您上述的行为负责，并且不受理由此发生的纠纷而带来的申诉。</span></view>
        <view>10.5 您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非本公司造成，由此可能导致您在某一操作系统中的充值和软件数据不能顺利转移到另一操作系统中。请您保持在同一操作系统中使用本软件，<span class="font-bold">由于您在不同系统进行切换造成的充值损失和软件数据丢失风险应由您自行承担，本公司对此不承担责任。</span></view>
        <view class="font-bold">11 知识产权</view>
        <view>11.1 本公司依法享有本软件的一切合法权益（包括但不限于其中涉及的计算机软件著作权、美术作品著作权、商标权、专利权等知识产权）；与本软件相关的所有信息内容（包括文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）及商业秘密均归本公司所有。本公司有权运营该等本软件，或已从合法权利人处取得合法授权，并有权为用户提供本软件及本服务。未经本公司事先书面同意，您不得以任何方式将本软件（包括本软件整体及本软件涉及的所有内容、组成部分或构成要素）进行商业性使用。</view>
        <view>11.2 您在使用本软件中产生的账号数据信息（用户姓名、身份证号、电话号码等个人身份信息数据除外）、虚拟物品数据信息（包括但不限于虚拟道具、虚拟礼物等）等软件数据的所有权和知识产权归本公司所有，并由本公司进行管理，并对该软件数据行使权利。</view>
        <view>11.3 本软件可能涉及第三方知识产权，而该等第三方对您基于本协议在本软件中使用该等知识产权有要求的，本公司将以适当方式向您告知该要求，您须一并遵守。</view>
        <view>11.4 本公司尊重知识产权并注重保护用户及他人享有的各项合法权益。在本服务中，您可能需要通过上传、发布等各种方式向本公司提供内容。<span class="font-bold">您保证，您对您在使用本软件及相关服务时上传、发布的文字、图片、音频、视频、链接、直播表演等内容享有完整的知识产权或已取得权利人的合法授权，不侵犯任何第三方的合法权益，包括但不限于知识产权、名誉权、隐私权。</span>您使用本软件及相关服务时上传、发布的任何内容的知识产权归属于您或原始权利人。<span class="font-bold">如有第三方针对您上传、发布的内容提出权利主张，您应自行处理并承担因此产生的全部法律责任，并赔偿本公司因此遭受的任何损失，本公司有权根据实际情况删除相关内容。</span></view>
        <view>11.5 为使您在使用本软件及相关服务时上传、发布的内容得到更好的分享及推广，本公司会在不影响您权利完整性的前提下为您上传、发布的内容提供额外的展示和推广机会。<span class="font-bold">您在此明确同意，将您在使用本软件及相关服务时上传、发布的文字、图片、音频、视频、链接、直播表演等内容，授予本公司及关联公司在全球范围内免费地、非独家地、可再许可地行使该等内容的复制权、改编权、翻译权、汇编权、表演权、信息网络传播权等，前述授权使用的范围亦包括使用该等内容中展示的肖像、姓名、名称、标识、品牌、商标等。如您不希望本公司继续使用全部或部分您基于本条已经授权本公司使用的内容，您可通知我们撤销该等授权。</span></view>
        <view>11.6 您充分了解并同意，<span class="font-bold">您在使用本软件时下载的其他用户上传、发布的内容仅供您个人学习、研究或欣赏，未经权利人许可，您不得将其他用户上传、发布的内容用于本条约定范围之外的目的，否则，您应承担由此导致的一切法律责任，并赔偿本公司因此遭受的任何损失。</span></view>
        <view class="font-bold">12 订阅及自动续订功能</view>
        <view>如果您购买或启用了本软件的订阅及自动续订功能，则代表您完全了解并同意以下的相关约定和使用规则：</view>
        <view>12.1 除非在当期订阅期结束的24 小时前取消订阅，否则您的订阅将会被自动续订。</view>
        <view>12.2 如果您未取消订阅，在当期订阅期结束前的24 小时内，您的软件账号将会被收取下期的订阅费用。</view>
        <view>12.3 在订阅期内，您不能取消当期的订阅。</view>
        <view>12.4 如果本公司提供免费试用服务，一旦您购买或启用了订阅功能，您未使用或未到期的试用服务也将自您订阅时起自动作废。</view>
        <view>12.5 如果您需要关闭自动续订功能，您可自行在软件账号管理页面更改或取消自动续订设定。</view>
        <view class="font-bold">13 遵守当地法律监管</view>
        <view>13.1 您在使用本软件过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此承担全部责任。</view>
        <view>13.2 您使用本公司软件服务时，应依法、理性发表言论，如您的言论、行为有可能使本公司面临政治和社会风险，本公司将暂停或终止对您的服务。</view>
        <view class="font-bold">14 管辖与法律适用</view>
        <view>14.1 本协议签订地为中华人民共和国广东省深圳市南山区。</view>
        <view>14.2 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。</view>
        <view>14.3 若您和本公司之间因本协议发生任何纠纷或争议，首先应友好协商解决；<span class="font-bold">协商不成的，您与本公司同意，将纠纷或争议提交至深圳国际仲裁院进行仲裁，并同意使用该仲裁院的仲裁规则。</span></view>
        <view>14.4 本协议所有条款的标题仅为阅读方便，本身并无实际含义，不能作为本协议含义解释的依据。</view>
        <view class="text-right">上海格乐喜网络信息科技有限公司</view>
        <view class="text-right">2024年11月21日生效</view>
      </view>
    </scroll-view>
  </view>
    
</template>

<script>
</script>

<style lang="scss" scoped>
  .wrapper {
    height: 100%;
    font-family: 'MiSans';
    uni-scroll-view {
      height: 100%;
    }
  }
 
  .content {
    view {
      margin-bottom: 20rpx;
      font-weight: 400;
      font-size: 32rpx;
      color: rgba(0,0,0,0.8);
      line-height: 48rpx;
    }
    .mt32 {
      margin-top: 60rpx;
    }
    .title {
      font-weight: 700;
      font-size: 40rpx;
      color: #000000;
      line-height: 40rpx;
      text-align: center;
      padding: 20rpx 0 30rpx;
    }
    .text-right {
      text-align: right;
    }
    .text-indent {
      text-indent: 66rpx;
    }
    .font-bold {
      font-weight: bold;
    }
  }
</style>