<template>
  <view class="agreement-wrapper">
    <scroll-view scroll-y="true" >
      <view class="title">
        咓咔超级社群VIP会员服务协议
      </view>
      <view class="content">
        <view>欢迎您阅读《咓咔超级社群VIP/SVIP会员服务协议》并成为咓咔VIP/SVIP会员！ </view>
        <view>《咓咔VIP/SVIP超级社群会员服务协议》（简称为“本协议”）是您与咓咔超级社群（以下统称为“咓咔社群”）之间关于“咓咔超级社群VIP/SVIP会员”以及“咓咔超级社群VIP/SVIP会员”中咓咔社群提供的各项服务（以下统称为“VIP/SVIP会员”）的法律协议。</view>
               <view>本协议中与您的权益（可能）存在重大关系的条款（包括相关免除咓咔社群责任的条款、限制您权利的条款、约定的争议解决方式及司法管辖条款等），咓咔社群已采用字体加粗的方式来特别提醒您，请您留意重点查阅。您应当在确认充分阅读字体加粗条款，明确理解的前提下使用VIP/SVIP会员服务。</view> 
               <view>根据国家法律法规、监管政策及行业规范变化、互联网高速发展态势及服务运营需要，咓咔社群有权修改、替换、升级咓咔社群软件/服务，并提前向用户进行公示（包括但不限于弹出公告、社群公告、系统消息、短消息等方式进行公示），同时据实修改咓咔社群服务相关协议条款/规则以覆盖您与咓咔社群的所有权利与义务，前述修改的协议条款/规则自公示期满之日起生效。如果用户不同意或者不接受咓咔社群相关软件/服务的修改、替代、升级，有权拒绝、停止、取消使用咓咔社群服务。如用户继续使用咓咔社群服务，那么视为悉知变动内容并同意接受。</view>
               <view>如果您未满18周岁，请在法定监护人的陪同下阅读本协议。</view> 
        <view>本协议是基于《咓咔超级社群用户使用协议》以及咓咔超级社群相关协议规范（统称为“咓咔超级社群服务条款”）制定，与其是不可分割的；同时，咓咔社群不时发布的关于VIP/SVIP会员的相关协议、活动规则等也是本协议的一部分，您在使用VIP/SVIP会员服务的同时应遵守本协议、咓咔社群服务条款及前述相关协议、活动规则等所有条款。 </view>
               <view>特别提示：您通过咓咔社群指定渠道开通VIP/SVIP会员服务后，可能会由于您使用的APP版本、设备、手机操作系统等不同以及第三方原因导致您实际可使用的具体服务有差别，由此可能给您带来的不便，您表示理解，并不会因此向咓咔超级社群提出任何主张或追究咓咔超级社群任何责任。同时，《咓咔超级社群VIP/SVIP会员服务协议》可能由于您使用的软件版本存在差别，您理解并同意本协议最终版本以咓咔超级社群APP提供版本为最终版本。</view> 
               <view>一．总则</view> 
               <view>（一） VIP/SVIP会员服务是咓咔超级社群在咓咔超级社群软件客户端中设立的网络增值服务。</view> 
               <view>（二） VIP/SVIP会员服务秉承以下宗旨：为成为VIP/SVIP会员的您提供各种更完善的线上增值服务，促进您与其他VIP会员、SVIP会员与咓咔超级社群之间的相互交流。</view> 
               <view>二．咓咔超级社群郑重声明： 咓咔超级社群VIP/SVIP会员服务，不影响咓咔超级社群现有的一切免费服务并保证服务质量。</view>
               <view>三．获得VIP/SVIP会员服务的程序</view> 
               <view>（一）成为VIP/SVIP会员的方法</view> 
               <view>1.您可通过咓咔超级社群指定的包括但不限于银行卡、支付宝、微信支付等现有方式或未来咓咔超级社群指定方式，在依约支付一定费用后开通VIP/SVIP会员；或通过咓咔超级社群官方活动/他人赠与获赠VIP/SVIP会员。VIP/SVIP会员价格可能因您使用软件的版本不同而产生差异，以开通服务时显示的金额为准。</view> 
               <view>2.您不得通过以下任何方式为自己或他人开通/获赠本服务：</view>
               <view>（1）以营利、经营等非个人使用的目的；</view> 
               <view>（2）通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、脚本、软件等方式；</view> 
               <view>（3）通过任何不正当手段或以违反诚实信用原则的方式（如利用规则漏洞、利用系统漏洞、黑色产业、投机等）；</view>
               <view>（4）通过技术手段对VIP/SVIP会员服务期限、消费金额、交易状态等信息进行修改；</view>
               <view>（5）通过非咓咔超级社群指定的方式；</view> 
               <view>（6）通过侵犯咓咔超级社群或他人合法权益的方式；</view>
               <view>（7）通过其他违反相关法律、行政法规、国家政策等方式。</view> 
        <view>您若违反以上规定的，咓咔超级社群有权根据您的实际情况采取修改、限制、中止或终止全部或部分您的VIP/SVIP会员服务，并不予任何赔偿或退还费用/会员积分。</view> 
               <view>3.您应通过咓咔超级社群指定方式加入VIP/SVIP会员，并须阅读、确认及遵守相关的协议和使用方法。您申请加入VIP/SVIP会员所提供的资料必须真实有效，并在您的个人资料发生变化时请及时修改注册的个人资料。</view> 
               <view>（二）您成为VIP/SVIP会员成功后，可享受VIP/SVIP会员多项专属特权和增值服务，有效日期以VIP/SVIP会员服务开通的时间算起，具体您可以在咓咔超级社群【我的钱包-续费管理 】页面进行查询。</view> 
               <view>（三）您的VIP/SVIP会员到期前，咓咔超级社群将通过站内消息-系统通知等方式提示您VIP/SVIP会员即将到期，您可再次通过购买/获赠等具体方式延续您的VIP/SVIP会员。若您的VIP/SVIP会员到期，咓咔超级社群将终止提供VIP/SVIP会员服务。</view> 
         <view>（四）您知悉并同意，VIP/SVIP会员服务系网络商品和虚拟商品，采用先收费后服务的方式，VIP/SVIP会员费用是您所购买的VIP/SVIP会员服务所对应的网络商品价格，而非预付款或者存款、定金、储蓄卡等性质，VIP/SVIP会员服务一经开通后不可转让或退款（如因VIP/SVIP会员服务存在重大瑕疵导致您完全无法使用等咓咔超级社群违约情形、本协议另有约定、法律法规要求必须退款的或您通过客服联系咓咔超级社群并经咓咔超级社群判断后认为可以退款等情形除外）。若您不接受VIP/SVIP会员服务，您可停止使用VIP/SVIP会员服务或停止继续订阅VIP/SVIP会员服务。 </view>
               <view>四．咓咔超级社群的义务 </view>
               <view>咓咔超级社群在为VIP/SVIP会员提供多项专属特权和增值服务同时，尽最大努力确保VIP/SVIP会员服务的稳定性，为此提供各项技术及客服支持，包括但不限于：</view> 
               <view>（一）开通、获赠成为VIP/SVIP会员期间所遇到的注册、登陆、购买、赠送等问题的网上咨询客户服务；</view> 
               <view>（二）VIP/SVIP会员服务积极有效的内容支持和技术支持，包括日常运营、维护、修复及更新；</view> 
               <view>（三）VIP/SVIP会员服务提供期间产生的常见问题解答、基本规则解释； </view>
               <view>（四）对VIP/SVIP员服务引起的程序、数据进行管理和监控，保障VIP/SVIP会员服务的稳定性；</view> 
               <view>（五）尽最大努力防止VIP/SVIP会员服务的服务器和技术设备遭受恶意攻击，以保障您的合法利益；</view>
               <view>（六）咓咔超级社群互动服务及其所需服务器； </view>
               <view>（七）咓咔超级社群提供给您的其他技术和/或服务。</view> 
               <view>五．VIP/SVIP会员守则 </view>
               <view>（一）您成为VIP/SVIP会员后将享有各项VIP/SVIP会员专属特权，您可在【我的-会员中心】页面查看VIP/SVIP会员专属特权。此外，为了提升您的VIP/SVIP会员服务体验，咓咔超级社群还将定期升级各项附赠的增值服务（包括但不限于装扮特权、身份特权、贴纸标签特权等），附赠的增值服务内容请以【我的-会员中心】中的相关页面信息为准。本协议项下的VIP/SVIP会员特权名称与页面的说明不一致的，不影响您所实际享受的会员权益的内容。</view> 
               <view>（二）在您申请VIP/SVIP会员服务填写注册资料时，请您填写真实有效的信息。</view> 
               <view>（三）您不得采取出售、转让、盗用、租赁其他用户账户等方式进行VIP/SVIP会员注册或通过出售、转让、盗用、转借、租赁其他VIP/SVIP会员账户等方式享用VIP/SVIP会员。</view> 
               <view>（四）您理解并同意：咓咔超级社群有权根据服务的整体规划、自身运营策略的变化等，对附赠的增值服务内容进行实时调整。</view> 
               <view>（六）如您违反本协议或咓咔超级社群服务条款，咓咔超级社群有权利采取以下一项或多项措施处理：</view>
               <view>1.采取技术手段，删除、屏蔽或断开相关信息；</view>
               <view>2.修改、限制、中止或终止全部或部分VIP/SVIP会员服务；</view>
               <view>3.收取违约金，并将您已支付而未使用的任何费用、积分或权益等冲抵违约金；若违约金不足以赔偿损失，则进一步要求您赔偿损失。</view> 
               <view>（七）您在使用VIP/SVIP会员服务的过程中，应遵守法律法规及其他规范性文件，包括但不限于《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《中华人民共和国网络安全法》、《信息网络传播权保护条例》等；应遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。在任何情况下，咓咔超级社群一旦合理地认为您存在上述行为的，可以不经事先通知终止向您提供VIP/SVIP会员服务。</view> 
               <view>（八）请您负责妥善且正确地保管、使用、维护您的VIP/SVIP会员资料、账户信息及账户密码。请您对您账户信息和账户密码采取必要和有效的保密措施。为保护账号安全，防止账号被盗等情况发生，咓咔超级社群可能会不时或定期采用一种或多种方式对账号使用者进行用户身份验证（如短信验证、系统消息认证等），如未成功通过验证的，咓咔超级社群有合理理由怀疑该账号出现被盗等不安全情况，并视情节严重情况而决定是否中止向该账号继续提供VIP/SVIP会员服务及/或采取进一步措施。</view> 
               <view>六．隐私保护 </view>
               <view>您理解并同意，咓咔超级社群将按照《咓咔超级社群隐私政策》的约定处理和保护您的个人信息。 </view>
               <view>七.未成年人保护 </view>
               <view>（一）咓咔超级社群非常注重未成年人的保护。若您为未成年人，应在监护人监护、指导下阅读本协议，并在取得监护人的同意后使用VIP/SVIP会员服务。</view> 
               <view>（二）监护人应指导子女上网应该注意的安全问题，防患于未然。若监护人同意未成年人使用VIP/SVIP会员服务，必须以监护人名义申请消费，并对未成年人使用VIP/SVIP会员服务进行正确引导、监督。未成年人使用VIP/SVIP会员服务，以及行使和履行本协议项下的权利和义务即视为已获得了监护人的认可。 </view>
               <view>（三）咓咔超级社群提醒未成年人在使用VIP/SVIP会员服务时，要善于网上学习，认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活。</view>
         
               <view>八．VIP/SVIP会员服务的通知和公告办法 </view>
        <view>VIP/SVIP会员服务的通知和公告将通过以下形式之一或多种形式对VIP/SVIP会员发布，VIP/SVIP会员可通过该公告查询最新的VIP/SVIP会员专属特权内容和附赠的增值服务内容、账户信息、VIP/SVIP会员的权利义务、服务规则等，并需严格遵守相应的服务规则</view>
               <view>1. 咓咔超级社群社群公告或系统消息；</view>
               <view>2.您提供的手机号码短消息；</view>
               <view>3. 咓咔超级社群APP主站公告；</view>
               <view>4. VIP/SVIP会员中心页面等。</view>  
        <view>九．VIP/SVIP会员服务的中止或终止 </view>
               <view>（一）在发生如下情况时，咓咔超级社群有权中止或终止向您提供VIP/SVIP会员服务：</view> 
               <view>1.您主动中止或终止的，包括但不限于到期未进行续费等； </view>
               <view>2.您存在或咓咔超级社群经独立判断后认为您存在任何违反国家法律法规或监管政策、违反本协议及咓咔超级社群服务条款、影响或可能影响咓咔超级社群或/及其关联公司的声誉、利益的行为的； </view>
               <view>3.根据法律法规、监管政策的规定或有权机关的要求； </view>
               <view>4.为维护账号与系统安全等紧急情况之需要； </view>
               <view>5.不可抗力（指不能预见、不能避免且不能克服的客观情况，包括国家法律、法规、政策及国家机关的命令及其他政府行为或者其它的诸如台风、洪水、地震、海啸、战争、罢工等）； </view>
               <view>6.其他咓咔超级社群无法抗拒的情况。 </view>
               <view>（二）当发生前述中止或终止的情况时，您认可如下处理方式：</view> 
               <view>1.如发生前述终止的情况时，已经产生但未使用的VIP/SVIP会员权益自动清除且不折现；</view> 
               <view>2.除法律法规另有规定或咓咔超级社群另有说明外，已收取的VIP/SVIP会员费用不予退还；</view>
               <view>3.如您在咓咔超级社群平台内有正在进行中的交易，咓咔超级社群届时将视情况进行合理处理；</view> 
               <view>4.如因您违反本协议导致终止的，咓咔超级社群有权视情况要求您承担相应的违约责任；</view> 
               <view>5.除法律法规另有规定或咓咔超级社群另有说明外，咓咔超级社群无需向您和第三人承担任何责任。 </view>
        <view>十．法律的适用和管辖 </view>
               <view>本协议的解释，效力及纠纷的解决，适用于中华人民共和国大陆地区法律法规。如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，则争议各方均一致同意将争议提交上海仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决为一裁终局，对各方均有法律约束力。</view>
      </view>
    </scroll-view>
  </view>
    
</template>

<script>
</script>

<style lang="scss" scoped>
  .agreement-wrapper {
    height: 100%;
    font-family: 'MiSans';
    uni-scroll-view {
      height: 100%;
    }
  }
 
  .content {
    view {
      margin-bottom: 20rpx;
      font-weight: 400;
      font-size: 32rpx;
      color: rgba(0,0,0,0.8);
      line-height: 48rpx;
    }
    .mt32 {
      margin-top: 60rpx;
    }
    .title {
      font-weight: 700;
      font-size: 40rpx;
      color: #000000;
      line-height: 40rpx;
      text-align: center;
      padding: 20rpx 0 30rpx;
    }
    .text-right {
      text-align: right;
    }
    .text-indent {
      text-indent: 66rpx;
    }
    .font-bold {
      font-weight: bold;
    }
  }
</style>